---
kind: type
id: T:Autodesk.Revit.DB.GroupSetIterator
source: html/da2e2718-c83a-f386-ae9c-beca78f9a728.htm
---
# Autodesk.Revit.DB.GroupSetIterator

An iterator to a group set.

## Syntax (C#)
```csharp
public abstract class GroupSetIterator : APIObject,
	IEnumerator
```